#include <stdio.h>
/*Дектярев Михаил Павлович
П.И. 1-1
Вычисление площади и периметра прямоугольника
*/

int main() {
	double a, b;
	double S, P; 
    printf("========================================\n"); //40
    printf("\t ПАРАМЕТРЫ ПРЯМОУГОЛЬНИКА\n");
    printf("========================================\n");
    scanf("%lf %lf", &a, &b);
    printf("Введите длину и ширину: ");
    S = a * b;
    P = 2.0 * (a + b);
    printf("\n----------------------------------------\n");
    printf("Длина: %.2f\n", a);
    printf("Ширина: %.2f\n", b);
    printf("Площадь: %.2f\n", S);
    printf("Периметр: %.2f\n", P);
    printf("========================================\n");
    printf("Расчет завершён успешно");
    return 0;
}

